Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E15BU.atdf
               <instance name="TC4">
                  <register-group name="TC4"
                                  name-in-module="TC"
                                  address-space="base"
                                  offset="0x42003000"/>
                  <signals>
                     <signal group="WO" index="0" function="F" pad="PA22"/>
                  </signals>
                  <parameters>
                     <param name="CC8_NUM" value="2"/>
                     <param name="CC16_NUM" value="2"/>
                     <param name="CC32_NUM" value="2"/>
                     <param name="DITHERING_EXT" value="0"/>
                     <param name="GCLK_ID" value="21"/>
                     <param name="MASTER" value="1"/>
                     <param name="OW_NUM" value="1"/>
                     <param name="PERIOD_EXT" value="0"/>
                     <param name="SHADOW_EXT" value="0"/>
                     <param name="INSTANCE_ID" value="76"/>
                  </parameters>
               </instance>
               <instance name="TC5">
                  <register-group name="TC5"
                                  name-in-module="TC"
                                  address-space="base"
                                  offset="0x42003400"/>
                  <parameters>
                     <param name="CC8_NUM" value="2"/>
                     <param name="CC16_NUM" value="2"/>
                     <param name="CC32_NUM" value="2"/>
                     <param name="DITHERING_EXT" value="0"/>
                     <param name="GCLK_ID" value="21"/>
                     <param name="MASTER" value="0"/>
                     <param name="OW_NUM" value="0"/>
                     <param name="PERIOD_EXT" value="0"/>
                     <param name="SHADOW_EXT" value="0"/>
                     <param name="INSTANCE_ID" value="77"/>
                  </parameters>
               </instance>
            </module>
            <module name="WDT" id="U2203" version="2.0.0">
               <instance name="WDT">
                  <register-group name="WDT"
                                  name-in-module="WDT"
                                  address-space="base"
                                  offset="0x40001000"/>
                  <parameters>
                     <param name="GCLK_ID" value="1" caption="Index of Generic Clock"/>
                     <param name="INSTANCE_ID" value="4"/>
                  </parameters>
               </instance>
            </module>
            <module name="NVIC" version="1.0.0">
               <instance name="NVIC">
                  <register-group name="NVIC"
                                  name-in-module="NVIC"
                                  address-space="base"
                                  offset="0xE000E100"/>
                  <parameters>
                     <param name="NUM_IRQ" value="25" caption="Number of interrupt requests"/>
                     <param name="__NVIC_PRIO_BITS"
                            value="2"
                            caption="Number of NVIC interrupt priority bits"/>
                  </parameters>
               </instance>
            </module>
            <module name="SysTick" version="1.0.0">
               <instance name="SysTick">
                  <register-group name="SysTick"
                                  name-in-module="SysTick"
                                  address-space="base"
                                  offset="0xE000E010"/>
               </instance>
            </module>
            <module name="SystemControl" version="1.0.0">
               <instance name="SystemControl">
                  <register-group name="SystemControl"
                                  name-in-module="SystemControl"
                                  address-space="base"
                                  offset="0xE000E000"/>
                  <parameters>
                     <param name="__VTOR_PRESENT"
                            value="1"
                            caption="Vector Table Offset Register present"/>
                  </parameters>
               </instance>
            </module>
         </peripherals>
         <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
            <interrupt name="Reset"
                       index="-15"
                       caption="Reset Vector, invoked on Power up and warm reset"
                       header:alternate-caption="Reset Vector"/>
            <interrupt name="NonMaskableInt"
                       index="-14"
                       caption="Non maskable Interrupt, cannot be stopped or preempted"
                       header:alternate-caption="Non-maskable Interrupt"/>
            <interrupt name="HardFault"
                       index="-13"
                       caption="Hard Fault, all classes of Fault"
                       header:alternate-caption="Hard Fault"/>
            <interrupt name="SVCall"
                       index="-5"
                       caption="System Service Call via SVC instruction"
                       header:alternate-caption="SuperVisor Call"/>
            <interrupt name="PendSV"
                       index="-2"
                       caption="Pendable request for system service"
                       header:alternate-caption="Pendable SerVice"/>
            <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
            <interrupt name="PM"
                       index="0"
                       module-instance="PM"
                       caption="Power Manager"/>
            <interrupt name="SYSCTRL"
                       index="1"
                       module-instance="SYSCTRL"
                       caption="System Controller"/>
            <interrupt name="WDT"
                       index="2"
                       module-instance="WDT"
                       caption="Watchdog Timer"/>
            <interrupt name="RTC"
                       index="3"
                       module-instance="RTC"
                       caption="Real Time Counter"/>
            <interrupt name="EIC"
                       index="4"
                       module-instance="EIC"
                       caption="External Interrupt Controller"/>
            <interrupt name="NVMCTRL"
                       index="5"
                       module-instance="NVMCTRL"
                       caption="Non-Volatile Memory Controller"/>
            <interrupt name="EVSYS"
                       index="6"
                       module-instance="EVSYS"
                       caption="Event Systems"/>
            <interrupt name="SERCOM0"
                       index="7"
                       module-instance="SERCOM0"
                       caption="Serial Communication Interface 0"/>
            <interrupt name="SERCOM1"
                       index="8"
                       module-instance="SERCOM1"
                       caption="Serial Communication Interface 1"/>
            <interrupt name="SERCOM2"
                       index="9"
                       module-instance="SERCOM2"
                       caption="Serial Communication Interface 2"/>
            <interrupt name="SERCOM3"
                       index="10"
                       module-instance="SERCOM3"
                       caption="Serial Communication Interface 3"/>
            <interrupt name="TC0"
                       index="13"
                       module-instance="TC0"
                       caption="Timer/Counter 0"/>
            <interrupt name="TC1"
                       index="14"
                       module-instance="TC1"
                       caption="Timer/Counter 1"/>
            <interrupt name="TC2"
                       index="15"
                       module-instance="TC2"
                       caption="Timer/Counter 2"/>
            <interrupt name="TC3"
                       index="16"
                       module-instance="TC3"
                       caption="Timer/Counter 3"/>
            <interrupt name="TC4"
                       index="17"
                       module-instance="TC4"
                       caption="Timer/Counter 4"/>
            <interrupt name="TC5"
                       index="18"
                       module-instance="TC5"
                       caption="Timer/Counter 5"/>
            <interrupt name="ADC"
                       index="21"
                       module-instance="ADC"
                       caption="Analog-to-Digital Converter"/>
            <interrupt name="AC"
                       index="22"
                       module-instance="AC"
                       caption="Analog Comparators"/>
            <interrupt name="DAC"
                       index="23"
                       module-instance="DAC"
                       caption="Digital-to-Analog Converter"/>
            <interrupt name="PTC"
                       index="24"
                       module-instance="PTC"
                       caption="Peripheral Touch Controller"/>
         </interrupts>
         <events>
            <generators>
               <generator name="RTC_CMP_0" index="1" module-instance="RTC"/>
               <generator name="RTC_CMP_1" index="2" module-instance="RTC"/>
               <generator name="RTC_OVF" index="3" module-instance="RTC"/>
               <generator name="RTC_PER_0" index="4" module-instance="RTC"/>
               <generator name="RTC_PER_1" index="5" module-instance="RTC"/>
               <generator name="RTC_PER_2" index="6" module-instance="RTC"/>
               <generator name="RTC_PER_3" index="7" module-instance="RTC"/>
               <generator name="RTC_PER_4" index="8" module-instance="RTC"/>
               <generator name="RTC_PER_5" index="9" module-instance="RTC"/>
               <generator name="RTC_PER_6" index="10" module-instance="RTC"/>
               <generator name="RTC_PER_7" index="11" module-instance="RTC"/>
               <generator name="EIC_EXTINT_0" index="12" module-instance="EIC"/>
               <generator name="EIC_EXTINT_1" index="13" module-instance="EIC"/>
               <generator name="EIC_EXTINT_2" index="14" module-instance="EIC"/>
               <generator name="EIC_EXTINT_3" index="15" module-instance="EIC"/>
               <generator name="EIC_EXTINT_4" index="16" module-instance="EIC"/>
               <generator name="EIC_EXTINT_5" index="17" module-instance="EIC"/>
               <generator name="EIC_EXTINT_6" index="18" module-instance="EIC"/>
               <generator name="EIC_EXTINT_7" index="19" module-instance="EIC"/>
               <generator name="EIC_EXTINT_8" index="20" module-instance="EIC"/>
               <generator name="EIC_EXTINT_9" index="21" module-instance="EIC"/>
               <generator name="EIC_EXTINT_10" index="22" module-instance="EIC"/>
               <generator name="EIC_EXTINT_11" index="23" module-instance="EIC"/>
               <generator name="EIC_EXTINT_12" index="24" module-instance="EIC"/>
               <generator name="EIC_EXTINT_13" index="25" module-instance="EIC"/>
               <generator name="EIC_EXTINT_14" index="26" module-instance="EIC"/>
               <generator name="EIC_EXTINT_15" index="27" module-instance="EIC"/>
               <generator name="TC0_OVF" index="28" module-instance="TC0"/>
               <generator name="TC0_MC_0" index="29" module-instance="TC0"/>
               <generator name="TC0_MC_1" index="30" module-instance="TC0"/>
               <generator name="TC1_OVF" index="31" module-instance="TC1"/>
               <generator name="TC1_MC_0" index="32" module-instance="TC1"/>
               <generator name="TC1_MC_1" index="33" module-instance="TC1"/>
               <generator name="TC2_OVF" index="34" module-instance="TC2"/>
               <generator name="TC2_MC_0" index="35" module-instance="TC2"/>
               <generator name="TC2_MC_1" index="36" module-instance="TC2"/>
               <generator name="TC3_OVF" index="37" module-instance="TC3"/>
               <generator name="TC3_MC_0" index="38" module-instance="TC3"/>
               <generator name="TC3_MC_1" index="39" module-instance="TC3"/>
               <generator name="TC4_OVF" index="40" module-instance="TC4"/>
               <generator name="TC4_MC_0" index="41" module-instance="TC4"/>
               <generator name="TC4_MC_1" index="42" module-instance="TC4"/>
               <generator name="TC5_OVF" index="43" module-instance="TC5"/>
               <generator name="TC5_MC_0" index="44" module-instance="TC5"/>
               <generator name="TC5_MC_1" index="45" module-instance="TC5"/>
               <generator name="ADC_RESRDY" index="52" module-instance="ADC"/>
               <generator name="ADC_WINMON" index="53" module-instance="ADC"/>
               <generator name="AC_COMP_0" index="54" module-instance="AC"/>
               <generator name="AC_COMP_1" index="55" module-instance="AC"/>
               <generator name="AC_WIN_0" index="56" module-instance="AC"/>
               <generator name="DAC_EMPTY" index="57" module-instance="DAC"/>
            </generators>
            <users>
               <user name="TC0_EVU" index="0" module-instance="TC0"/>
               <user name="TC1_EVU" index="1" module-instance="TC1"/>
               <user name="TC2_EVU" index="2" module-instance="TC2"/>
               <user name="TC3_EVU" index="3" module-instance="TC3"/>
               <user name="TC4_EVU" index="4" module-instance="TC4"/>
               <user name="TC5_EVU" index="5" module-instance="TC5"/>
               <user name="ADC_START" index="8" module-instance="ADC"/>
               <user name="ADC_SYNC" index="9" module-instance="ADC"/>
               <user name="AC_SOC_0" index="10" module-instance="AC"/>
               <user name="AC_SOC_1" index="11" module-instance="AC"/>
               <user name="DAC_START" index="12" module-instance="DAC"/>
            </users>
         </events>
         <interfaces>
            <interface name="SWD" type="swd"/>
         </interfaces>
         <property-groups>
            <property-group name="SIGNATURES">
               <property name="DSU_DID" value="0x10001610"/>
            </property-group>
         </property-groups>
      </device>
   </devices>
   <modules>
      <module name="AC"
              id="U2205"
              version="1.1.1"
              caption="Analog Comparators">
         <register-group name="AC" caption="Analog Comparators">
            <register name="CTRLA"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control A">
               <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x4"/>
               <bitfield name="LPMUX" caption="Low-Power Mux" mask="0x80"/>
            </register>
            <register name="CTRLB"
                      offset="0x1"
                      rw="W"
                      size="1"
                      initval="0x00"
                      caption="Control B">
               <bitfield name="START0" caption="Comparator 0 Start Comparison" mask="0x1"/>
               <bitfield name="START1" caption="Comparator 1 Start Comparison" mask="0x2"/>
            </register>
            <register name="EVCTRL"
                      offset="0x2"
                      rw="RW"
                      size="2"
                      initval="0x0000"
                      caption="Event Control">
               <bitfield name="COMPEO0"
                         caption="Comparator 0 Event Output Enable"
                         mask="0x1"/>
               <bitfield name="COMPEO1"
                         caption="Comparator 1 Event Output Enable"
                         mask="0x2"/>
               <bitfield name="WINEO0" caption="Window 0 Event Output Enable" mask="0x10"/>
               <bitfield name="COMPEI0" caption="Comparator 0 Event Input" mask="0x100"/>
               <bitfield name="COMPEI1" caption="Comparator 1 Event Input" mask="0x200"/>
            </register>
