Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E15BU.atdf
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
               <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="COMP0" caption="Comparator 0 Interrupt Enable" mask="0x1"/>
               <bitfield name="COMP1" caption="Comparator 1 Interrupt Enable" mask="0x2"/>
               <bitfield name="WIN0" caption="Window 0 Interrupt Enable" mask="0x10"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="COMP0" caption="Comparator 0" mask="0x1"/>
               <bitfield name="COMP1" caption="Comparator 1" mask="0x2"/>
               <bitfield name="WIN0" caption="Window 0" mask="0x10"/>
            </register>
            <register name="STATUSA"
                      offset="0x8"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status A">
               <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
               <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
               <bitfield name="WSTATE0"
                         caption="Window 0 Current State"
                         mask="0x30"
                         values="AC_STATUSA__WSTATE0"/>
            </register>
            <register name="STATUSB"
                      offset="0x9"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status B">
               <bitfield name="READY0" caption="Comparator 0 Ready" mask="0x1"/>
               <bitfield name="READY1" caption="Comparator 1 Ready" mask="0x2"/>
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register name="STATUSC"
                      offset="0xA"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status C">
               <bitfield name="STATE0" caption="Comparator 0 Current State" mask="0x1"/>
               <bitfield name="STATE1" caption="Comparator 1 Current State" mask="0x2"/>
               <bitfield name="WSTATE0"
                         caption="Window 0 Current State"
                         mask="0x30"
                         values="AC_STATUSC__WSTATE0"/>
            </register>
            <register name="WINCTRL"
                      offset="0xC"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Window Control">
               <bitfield name="WEN0" caption="Window 0 Mode Enable" mask="0x1"/>
               <bitfield name="WINTSEL0"
                         caption="Window 0 Interrupt Selection"
                         mask="0x6"
                         values="AC_WINCTRL__WINTSEL0"/>
            </register>
            <register name="COMPCTRL"
                      offset="0x10"
                      rw="RW"
                      access="WSYNC"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="Comparator Control n">
               <bitfield name="ENABLE" caption="Enable" mask="0x1"/>
               <bitfield name="SINGLE" caption="Single-Shot Mode" mask="0x2"/>
               <bitfield name="SPEED"
                         caption="Speed Selection"
                         mask="0xC"
                         values="AC_COMPCTRL__SPEED"/>
               <bitfield name="INTSEL"
                         caption="Interrupt Selection"
                         mask="0x60"
                         values="AC_COMPCTRL__INTSEL"/>
               <bitfield name="MUXNEG"
                         caption="Negative Input Mux Selection"
                         mask="0x700"
                         values="AC_COMPCTRL__MUXNEG"/>
               <bitfield name="MUXPOS"
                         caption="Positive Input Mux Selection"
                         mask="0x3000"
                         values="AC_COMPCTRL__MUXPOS"/>
               <bitfield name="SWAP" caption="Swap Inputs and Invert" mask="0x8000"/>
               <bitfield name="OUT"
                         caption="Output"
                         mask="0x30000"
                         values="AC_COMPCTRL__OUT"/>
               <bitfield name="HYST" caption="Hysteresis Enable" mask="0x80000"/>
               <bitfield name="FLEN"
                         caption="Filter Length"
                         mask="0x7000000"
                         values="AC_COMPCTRL__FLEN"/>
            </register>
            <register name="SCALER"
                      offset="0x20"
                      rw="RW"
                      size="1"
                      count="2"
                      initval="0x00"
                      caption="Scaler n">
               <bitfield name="VALUE" caption="Scaler Value" mask="0x3F"/>
            </register>
         </register-group>
         <value-group name="AC_STATUSA__WSTATE0">
            <value name="ABOVE" caption="Signal is above window" value="0"/>
            <value name="INSIDE" caption="Signal is inside window" value="1"/>
            <value name="BELOW" caption="Signal is below window" value="2"/>
         </value-group>
