Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E15BU.atdf
            <register name="DCC"
                      offset="0x10"
                      rw="RW"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="Debug Communication Channel n">
               <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
            </register>
            <register name="DID"
                      offset="0x18"
                      rw="R"
                      size="4"
                      initval="0x10001610"
                      caption="Device Identification">
               <bitfield name="DEVSEL" caption="Device Select" mask="0xFF"/>
               <bitfield name="REVISION" caption="Revision Number" mask="0xF00"/>
               <bitfield name="DIE" caption="Die Number" mask="0xF000"/>
               <bitfield name="SERIES"
                         caption="Series"
                         mask="0x3F0000"
                         values="DSU_DID__SERIES"/>
               <bitfield name="FAMILY"
                         caption="Family"
                         mask="0xF800000"
                         values="DSU_DID__FAMILY"/>
               <bitfield name="PROCESSOR"
                         caption="Processor"
                         mask="0xF0000000"
                         values="DSU_DID__PROCESSOR"/>
            </register>
            <register name="DCFG"
                      offset="0xF0"
                      rw="RW"
                      size="4"
                      count="2"
                      initval="0x00000000"
                      caption="Device Configuration">
               <bitfield name="DCFG" caption="Device Configuration" mask="0xFFFFFFFF"/>
            </register>
            <register name="ENTRY0"
                      offset="0x1000"
                      rw="R"
                      size="4"
                      initval="0x9F9FC002"
                      caption="Coresight ROM Table Entry 0">
               <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
               <bitfield name="FMT" caption="Format" mask="0x2"/>
               <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
            </register>
            <register name="ENTRY1"
                      offset="0x1004"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Coresight ROM Table Entry 1">
        </register>
            <register name="END"
                      offset="0x1008"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Coresight ROM Table End">
               <bitfield name="END" caption="End Marker" mask="0xFFFFFFFF"/>
            </register>
            <register name="MEMTYPE"
                      offset="0x1FCC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Coresight ROM Table Memory Type">
               <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
            </register>
            <register name="PID4"
                      offset="0x1FD0"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 4">
               <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
               <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
            </register>
            <register name="PID5"
                      offset="0x1FD4"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 5">
        </register>
            <register name="PID6"
                      offset="0x1FD8"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 6">
        </register>
            <register name="PID7"
                      offset="0x1FDC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 7">
        </register>
            <register name="PID0"
                      offset="0x1FE0"
                      rw="R"
                      size="4"
                      initval="0x000000D0"
                      caption="Peripheral Identification 0">
               <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
            </register>
            <register name="PID1"
                      offset="0x1FE4"
                      rw="R"
                      size="4"
                      initval="0x000000FC"
                      caption="Peripheral Identification 1">
               <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
               <bitfield name="JEPIDCL"
                         caption="Low part of the JEP-106 Identity Code"
                         mask="0xF0"/>
            </register>
            <register name="PID2"
                      offset="0x1FE8"
                      rw="R"
                      size="4"
                      initval="0x00000009"
                      caption="Peripheral Identification 2">
               <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
               <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
               <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
            </register>
            <register name="PID3"
                      offset="0x1FEC"
                      rw="R"
                      size="4"
                      initval="0x00000000"
                      caption="Peripheral Identification 3">
               <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
               <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
            </register>
            <register name="CID0"
                      offset="0x1FF0"
                      rw="R"
                      size="4"
                      initval="0x0000000D"
                      caption="Component Identification 0">
               <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
            </register>
            <register name="CID1"
                      offset="0x1FF4"
                      rw="R"
                      size="4"
                      initval="0x00000010"
                      caption="Component Identification 1">
               <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
               <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
            </register>
