Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E15BU.atdf
            <register name="DFLLVAL"
                      offset="0x28"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="DFLL Calibration Value">
               <bitfield name="FINE" caption="Fine Calibration Value" mask="0x3FF"/>
               <bitfield name="COARSE" caption="Coarse Calibration Value" mask="0xFC00"/>
               <bitfield name="DIFF"
                         caption="Multiplication Ratio Difference"
                         mask="0xFFFF0000"/>
            </register>
            <register name="DFLLMUL"
                      offset="0x2C"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="DFLL Multiplier">
               <bitfield name="MUL" caption="Multiplication Value" mask="0xFFFF"/>
               <bitfield name="FSTEP" caption="Maximum Fine Step Size" mask="0x3FF0000"/>
               <bitfield name="CSTEP" caption="Maximum Coarse Step Size" mask="0xFC000000"/>
            </register>
            <register name="DFLLSYNC"
                      offset="0x30"
                      rw="RW"
                      size="1"
                      initval="0x00"
                      caption="DFLL Synchronization">
               <bitfield name="READREQ" caption="Read Request Synchronization" mask="0x80"/>
            </register>
            <register name="BOD33"
                      offset="0x34"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="3.3V Brown-Out Detector (BOD33) Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="HYST" caption="Hysteresis Enable" mask="0x4"/>
               <bitfield name="ACTION"
                         caption="Action when Threshold Crossed"
                         mask="0x18"
                         values="SUPC_BODVDD__ACTION"/>
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
               <bitfield name="MODE" caption="Operation Modes" mask="0x100"/>
               <bitfield name="CEN" caption="Clock Enable" mask="0x200"/>
               <bitfield name="PSEL"
                         caption="Prescaler Select"
                         mask="0xF000"
                         values="SUPC_BODVDD__PSEL"/>
               <bitfield name="LEVEL" caption="Threshold Level" mask="0x3F0000"/>
            </register>
            <register name="VREG"
                      offset="0x3C"
                      rw="RW"
                      size="2"
                      initval="0x0402"
                      caption="VREG Control">
               <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
               <bitfield name="FORCELDO" caption="Force LDO Voltage Regulator" mask="0x2000"/>
            </register>
            <register name="VREF"
                      offset="0x40"
                      rw="RW"
                      size="4"
                      initval="0x00000000"
                      caption="VREF Control A">
               <bitfield name="TSEN" caption="Temperature Sensor Output Enable" mask="0x2"/>
               <bitfield name="BGOUTEN" caption="Bandgap Output Enable" mask="0x4"/>
               <bitfield name="CALIB"
                         caption="Voltage Reference Calibration Value"
                         mask="0x7FF0000"/>
            </register>
         </register-group>
         <value-group name="SYSCTRL_XOSC__GAIN">
            <value name="0" caption="2MHz" value="0x0"/>
            <value name="1" caption="4MHz" value="0x1"/>
            <value name="2" caption="8MHz" value="0x2"/>
            <value name="3" caption="16MHz" value="0x3"/>
            <value name="4" caption="30MHz" value="0x4"/>
         </value-group>
         <value-group name="SYSCTRL_OSC8M__FRANGE">
            <value name="0" caption="4 to 6MHz" value="0x0"/>
            <value name="1" caption="6 to 8MHz" value="0x1"/>
            <value name="2" caption="8 to 11MHz" value="0x2"/>
            <value name="3" caption="11 to 15MHz" value="0x3"/>
         </value-group>
         <value-group name="SYSCTRL_OSC8M__PRESC">
            <value name="0" caption="1" value="0x0"/>
            <value name="1" caption="2" value="0x1"/>
            <value name="2" caption="4" value="0x2"/>
            <value name="3" caption="8" value="0x3"/>
         </value-group>
         <value-group name="SYSCTRL_XOSC__STARTUP">
            <value name="CYCLE1" caption="31 us" value="0"/>
            <value name="CYCLE2" caption="61 us" value="1"/>
            <value name="CYCLE4" caption="122 us" value="2"/>
            <value name="CYCLE8" caption="244 us" value="3"/>
            <value name="CYCLE16" caption="488 us" value="4"/>
            <value name="CYCLE32" caption="977 us" value="5"/>
            <value name="CYCLE64" caption="1953 us" value="6"/>
            <value name="CYCLE128" caption="3906 us" value="7"/>
            <value name="CYCLE256" caption="7813 us" value="8"/>
            <value name="CYCLE512" caption="15625 us" value="9"/>
            <value name="CYCLE1024" caption="31250 us" value="10"/>
            <value name="CYCLE2048" caption="62500 us" value="11"/>
            <value name="CYCLE4096" caption="125000 us" value="12"/>
            <value name="CYCLE8192" caption="250000 us" value="13"/>
            <value name="CYCLE16384" caption="500000 us" value="14"/>
            <value name="CYCLE32768" caption="1000000 us" value="15"/>
         </value-group>
         <value-group name="SYSCTRL_OSC32K__STARTUP">
            <value name="CYCLE3" caption="0.092 ms" value="0"/>
            <value name="CYCLE4" caption="0.122 ms" value="1"/>
            <value name="CYCLE6" caption="0.183 ms" value="2"/>
            <value name="CYCLE10" caption="0.305 ms" value="3"/>
            <value name="CYCLE18" caption="0.549 ms" value="4"/>
            <value name="CYCLE34" caption="1.038 ms" value="5"/>
            <value name="CYCLE66" caption="2.014 ms" value="6"/>
            <value name="CYCLE130" caption="3.967 ms" value="7"/>
         </value-group>
         <value-group name="SYSCTRL_XOSC32K__STARTUP">
            <value name="CYCLE1" caption="0.122 ms" value="0"/>
            <value name="CYCLE32" caption="1.068 ms" value="1"/>
            <value name="CYCLE2048" caption="62.592 ms" value="2"/>
            <value name="CYCLE4096" caption="125.092 ms" value="3"/>
            <value name="CYCLE16384" caption="500.092 ms" value="4"/>
            <value name="CYCLE32768" caption="1000.092 ms" value="5"/>
            <value name="CYCLE65536" caption="2000.092 ms" value="6"/>
            <value name="CYCLE131072" caption="4000.092 ms" value="7"/>
         </value-group>
