Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.6.112/samd20b/atdf/ATSAMD20E15BU.atdf
         <value-group name="TC_CTRLA__PRESCSYNC">
            <value name="GCLK"
                   caption="Reload or reset Counter on next GCLK"
                   value="0"/>
            <value name="PRESC"
                   caption="Reload or reset Counter on next prescaler clock"
                   value="1"/>
            <value name="RESYNC"
                   caption="Reload or reset Counter on next GCLK. Reset prescaler counter"
                   value="2"/>
         </value-group>
         <value-group name="TC_CTRLA__WAVEGEN">
            <value name="NFRQ" value="0"/>
            <value name="MFRQ" value="1"/>
            <value name="NPWM" value="2"/>
            <value name="MPWM" value="3"/>
         </value-group>
         <value-group name="TC_CTRLBCLR__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Force start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force stop" value="2"/>
         </value-group>
         <value-group name="TC_CTRLBSET__CMD">
            <value name="NONE" caption="No action" value="0"/>
            <value name="RETRIGGER"
                   caption="Force start, restart or retrigger"
                   value="1"/>
            <value name="STOP" caption="Force stop" value="2"/>
         </value-group>
         <value-group name="TC_EVCTRL__EVACT">
            <value name="OFF" caption="Event action disabled" value="0"/>
            <value name="RETRIGGER"
                   caption="Start, restart or retrigger TC on event"
                   value="1"/>
            <value name="COUNT" caption="Count on event" value="2"/>
            <value name="START" caption="Start TC on event" value="3"/>
            <value name="PPW"
                   caption="Period captured into CC0 Pulse Width in CC1"
                   value="5"/>
            <value name="PWP"
                   caption="Period captured into CC1 Pulse Width on CC0"
                   value="6"/>
         </value-group>
      </module>
      <module name="WDT" id="U2203" version="2.0.0" caption="Watchdog Timer">
         <register-group name="WDT" caption="Watchdog Timer">
            <register name="CTRL"
                      offset="0x0"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Control">
               <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
               <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
               <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
            </register>
            <register name="CONFIG"
                      offset="0x1"
                      rw="RW"
                      access="WSYNC"
                      size="1"
                      initval="0xBB"
                      caption="Configuration">
               <bitfield name="PER"
                         caption="Time-Out Period"
                         mask="0xF"
                         values="WDT_CONFIG__PER"/>
               <bitfield name="WINDOW"
                         caption="Window Mode Time-Out Period"
                         mask="0xF0"
                         values="WDT_CONFIG__WINDOW"/>
            </register>
            <register name="EWCTRL"
                      offset="0x2"
                      rw="RW"
                      size="1"
                      initval="0x0B"
                      caption="Early Warning Interrupt Control">
               <bitfield name="EWOFFSET"
                         caption="Early Warning Interrupt Time Offset"
                         mask="0xF"
                         values="WDT_EWCTRL__EWOFFSET"/>
            </register>
            <register name="INTENCLR"
                      offset="0x4"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTENCLR"
                      initval="0x00"
                      caption="Interrupt Enable Clear">
               <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTENSET"
                      offset="0x5"
                      rw="RW"
                      size="1"
                      atomic-op="set:INTENSET"
                      initval="0x00"
                      caption="Interrupt Enable Set">
               <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
            </register>
            <register name="INTFLAG"
                      offset="0x6"
                      rw="RW"
                      size="1"
                      atomic-op="clear:INTFLAG"
                      initval="0x00"
                      caption="Interrupt Flag Status and Clear">
               <bitfield name="EW" caption="Early Warning" mask="0x1"/>
            </register>
            <register name="STATUS"
                      offset="0x7"
                      rw="R"
                      size="1"
                      initval="0x00"
                      caption="Status">
               <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
            </register>
            <register name="CLEAR"
                      offset="0x8"
                      rw="W"
                      access="WSYNC"
                      size="1"
                      initval="0x00"
                      caption="Clear">
               <bitfield name="CLEAR"
                         caption="Watchdog Clear"
                         mask="0xFF"
                         values="WDT_CLEAR__CLEAR"/>
            </register>
         </register-group>
         <value-group name="WDT_CONFIG__PER">
            <value name="8" caption="8 clock cycles" value="0x0"/>
            <value name="16" caption="16 clock cycles" value="0x1"/>
            <value name="32" caption="32 clock cycles" value="0x2"/>
            <value name="64" caption="64 clock cycles" value="0x3"/>
            <value name="128" caption="128 clock cycles" value="0x4"/>
            <value name="256" caption="256 clock cycles" value="0x5"/>
            <value name="512" caption="512 clock cycles" value="0x6"/>
            <value name="1K" caption="1024 clock cycles" value="0x7"/>
            <value name="2K" caption="2048 clock cycles" value="0x8"/>
            <value name="4K" caption="4096 clock cycles" value="0x9"/>
            <value name="8K" caption="8192 clock cycles" value="0xA"/>
            <value name="16K" caption="16384 clock cycles" value="0xB"/>
         </value-group>
